nrfconnect/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
	/*** Presentation delay measurement ***/
	ctrl_blk.current_pres_dly_us =
		frame_start_ts_us - ctrl_blk.out.prod_blk_ts[ctrl_blk.out.cons_blk_idx];

	/********** I2S TX **********/
	static uint8_t *tx_buf;

	if (IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL) || (CONFIG_AUDIO_DEV == HEADSET)) {
		static bool underrun_condition;

		if (tx_buf_released == NULL) {
			ERR_CHK_MSG(-ENOMEM, "No TX data available");
		}

		/* Double buffered index */
		uint32_t next_out_blk_idx = NEXT_IDX(ctrl_blk.out.cons_blk_idx);

		if (next_out_blk_idx != ctrl_blk.out.prod_blk_idx) {
			/* Only increment if not in under-run condition */
			ctrl_blk.out.cons_blk_idx = next_out_blk_idx;
			if (underrun_condition) {
				underrun_condition = false;
				LOG_WRN("Data received, total under-runs: %d",
					ctrl_blk.out.total_blk_underruns);
			}

			tx_buf = (uint8_t *)&ctrl_blk.out
					 .fifo[next_out_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS];

		} else {
			if (stream_state_get() == STATE_STREAMING) {
				underrun_condition = true;
				ctrl_blk.out.total_blk_underruns++;

				if ((ctrl_blk.out.total_blk_underruns % LOG_INTERVAL_BLKS) == 0) {
					LOG_WRN("In I2S TX under-run condition, total: %d",
						ctrl_blk.out.total_blk_underruns);
				}
			}

			/*
			 * No data available in out.fifo
			 * use alternative buffers
			 */
			ret = alt_buffer_get((void **)&tx_buf);
			ERR_CHK(ret);

			memset(tx_buf, 0, BLK_MULTI_CHAN_SIZE_OCTETS);
		}

		if (tone_active) {
			tone_mix(tx_buf);
		}
	}

	/********** I2S RX **********/
	struct net_buf *rx_audio_block = NULL;
	static uint32_t num_overruns;
	static uint32_t num_overruns_last_printed;

	if (IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL) || (CONFIG_AUDIO_DEV == GATEWAY)) {
		if (rx_buf_released == NULL) {
			ERR_CHK_MSG(-ENOMEM, "No RX data available");
		}

		if (k_msgq_num_free_get(ctrl_blk.in.audio_q) == 0 || pool_i2s_rx.avail_count == 0) {
			/* If RX FIFO is filled up */
			num_overruns++;
			struct net_buf *stale_i2s_data;

			ret = k_msgq_get(ctrl_blk.in.audio_q, (void *)&stale_i2s_data, K_NO_WAIT);
			ERR_CHK(ret);
			/* Discard data */
			net_buf_unref(stale_i2s_data);
		}

		if ((num_calls % LOG_INTERVAL_BLKS == 0) &&
		    (num_overruns != num_overruns_last_printed)) {
			LOG_WRN("I2S RX overrun count: %d", num_overruns);
			num_overruns_last_printed = num_overruns;
		}

		rx_audio_block = net_buf_alloc(&pool_i2s_rx, K_NO_WAIT);
		if (rx_audio_block == NULL) {
			ERR_CHK_MSG(-ENOMEM, "Out of RX buffers for I2S");
		}

		/* Store RX buffer in net_buf */
		net_buf_add_mem(rx_audio_block, rx_buf_released, BLK_MULTI_CHAN_SIZE_OCTETS);

		/* Store I2S related metadata */
		struct audio_metadata *meta_rx = net_buf_user_data(rx_audio_block);
		*meta_rx = i2s_meta;

		ret = k_msgq_put(ctrl_blk.in.audio_q, (void *)&rx_audio_block, K_NO_WAIT);
		ERR_CHK_MSG(ret, "Unable to put RX audio block into queue");
	}

	/*** Data exchange ***/
	audio_i2s_set_next_buf(tx_buf, rx_buf_released);

	/*** Drift compensation ***/
	if (ctrl_blk.drift_comp.enabled) {
		audio_datapath_drift_compensation(frame_start_ts_us);
	}
}

static void audio_datapath_i2s_start(void)
{
	/* Double buffer I2S */
	uint8_t *tx_buf_0 = NULL;
	uint8_t *tx_buf_1 = NULL;

	/* Buffers used for I2S RX. Used interchangeably by I2S. */
	static uint32_t rx_buf_0[BLK_MULTI_CHAN_SIZE_OCTETS];
	static uint32_t rx_buf_1[BLK_MULTI_CHAN_SIZE_OCTETS];

	/* TX */
	if (IS_ENABLED(CONFIG_STREAM_BIDIRECTIONAL) || (CONFIG_AUDIO_DEV == HEADSET)) {
		ctrl_blk.out.cons_blk_idx = PREV_IDX(ctrl_blk.out.cons_blk_idx);
		tx_buf_0 = (uint8_t *)&ctrl_blk.out
				   .fifo[ctrl_blk.out.cons_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS];

		ctrl_blk.out.cons_blk_idx = PREV_IDX(ctrl_blk.out.cons_blk_idx);
		tx_buf_1 = (uint8_t *)&ctrl_blk.out
				   .fifo[ctrl_blk.out.cons_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS];
	}

	/* Start I2S */
	audio_i2s_start(tx_buf_0, rx_buf_0);
	audio_i2s_set_next_buf(tx_buf_1, rx_buf_1);
}

static void audio_datapath_i2s_stop(void)
{
	audio_i2s_stop();
	alt_buffer_free_both();
}

/**
 * @brief	Adjust timing to make sure audio data is sent just in time for Bluetooth LE event.
 *
 * @note	The time from last anchor point is checked and then blocks of 1 ms can be dropped to
 *		allow the sending of encoded data to be sent just before the connection interval
 *		opens up. This is done to reduce overall latency.
 *
 * @param[in]	tx_sync_ts_us	The timestamp from get_tx_sync.
 * @param[in]	curr_ts_us	The current time. This must be in the controller frame of reference.
 */
static void audio_datapath_just_in_time_check_and_adjust(uint32_t tx_sync_ts_us,
							 uint32_t curr_ts_us)
{
	int ret;
	static int32_t print_count;
	int64_t diff;

	diff = (int64_t)tx_sync_ts_us - curr_ts_us;

	/*
	 * The diff should always be positive. If diff is a large negative number, it
	 * is likely that wrapping has occurred. A small negative value however, may
	 * point to the application sending data too late, and we need to drop data to
	 * get back in sync with the controller.
	 */
	if (diff < -((int64_t)UINT32_MAX / 2)) {
		LOG_DBG("Timestamp wrap. diff: %lld", diff);
		diff += UINT32_MAX;

	} else if (diff < 0) {
		LOG_DBG("tx_sync_ts_us: %u is earlier than curr_ts_us %u", tx_sync_ts_us,
			curr_ts_us);
	}

	if (print_count % 100 == 0) {
		LOG_DBG("JIT diff: %lld us. Target: %u +/- %u", diff, JUST_IN_TIME_TARGET_DLY_US,
			JUST_IN_TIME_BOUND_US);
	}
	print_count++;

	if ((diff < (JUST_IN_TIME_TARGET_DLY_US - JUST_IN_TIME_BOUND_US)) ||
	    (diff > (JUST_IN_TIME_TARGET_DLY_US + JUST_IN_TIME_BOUND_US))) {
		ret = audio_system_fifo_rx_block_drop();
		if (ret) {
			LOG_WRN("Not able to drop FIFO RX block");
			return;
		}
		LOG_DBG("Dropped block to align with connection interval");
		print_count = 0;
	}
}

/**
 * @brief	Update sdu_ref_us so that drift compensation can work correctly.
 *
 * @note	This function is only valid for gateway using I2S as audio
 *		source and unidirectional audio stream (gateway to one or more headsets).
 *
 * @param	sdu_ref_us	ISO timestamp reference from Bluetooth LE controller.
 * @param	adjust		Indicate if the sdu_ref should be used to adjust timing.
 */
static void audio_datapath_sdu_ref_update(const struct zbus_channel *chan)
{
	if (IS_ENABLED(CONFIG_AUDIO_SOURCE_I2S)) {
		uint32_t tx_sync_ts_us;
		uint32_t curr_ts_us;
		bool adjust;
		const struct sdu_ref_msg *msg;

		msg = zbus_chan_const_msg(chan);
		tx_sync_ts_us = msg->tx_sync_ts_us;
		curr_ts_us = msg->curr_ts_us;
		adjust = msg->adjust;

		if (ctrl_blk.stream_started) {
			ctrl_blk.prev_drift_sdu_ref_us = tx_sync_ts_us;

			if (adjust && tx_sync_ts_us != 0) {
				audio_datapath_just_in_time_check_and_adjust(tx_sync_ts_us,
									     curr_ts_us);
			}
		} else {
			LOG_WRN("Stream not started - Can not update tx_sync_ts_us");
		}
	}
}

