nrfconnect/sdk-nrf/applications/nrf5340_audio/src/audio/audio_datapath.c
ZBUS_LISTENER_DEFINE(sdu_ref_msg_listen, audio_datapath_sdu_ref_update);

int audio_datapath_pres_delay_us_set(uint32_t delay_us)
{
	if (!IN_RANGE(delay_us, CONFIG_AUDIO_MIN_PRES_DLY_US, CONFIG_AUDIO_MAX_PRES_DLY_US)) {
		LOG_WRN("Presentation delay not supported: %d us", delay_us);
		LOG_WRN("Keeping current value: %d us", ctrl_blk.pres_comp.pres_delay_us);
		return -EINVAL;
	}

	ctrl_blk.pres_comp.pres_delay_us = delay_us;

	LOG_DBG("Presentation delay set to %d us", delay_us);

	return 0;
}

void audio_datapath_pres_delay_us_get(uint32_t *delay_us)
{
	*delay_us = ctrl_blk.pres_comp.pres_delay_us;
}

void audio_datapath_stream_out(struct net_buf *audio_frame_in)
{
	bool sdu_ref_not_consecutive = false;

	if (!ctrl_blk.stream_started) {
		LOG_WRN("Stream not started");
		return;
	}

	if (audio_frame_in == NULL) {
		LOG_ERR("Audio frame is NULL");
		return;
	}

	/*** Check incoming data ***/
	struct audio_metadata *meta_in = net_buf_user_data(audio_frame_in);

	if (meta_in->ref_ts_us == ctrl_blk.prev_pres_sdu_ref_us && meta_in->ref_ts_us != 0) {
		LOG_WRN("Duplicate sdu_ref_us (%d) - Dropping audio frame", meta_in->ref_ts_us);
		return;
	}

	uint32_t sdu_ref_delta_us = meta_in->ref_ts_us - ctrl_blk.prev_pres_sdu_ref_us;

	if (meta_in->ref_ts_us == 0 && ctrl_blk.prev_pres_sdu_ref_us == 0) {
		/* Timestamp not received yet */
		ctrl_blk.prev_pres_sdu_ref_us = meta_in->ref_ts_us;
		sdu_ref_not_consecutive = true;

	} else if (sdu_ref_delta_us > CONSECUTIVE_TS_LIMIT_US) {
		/* If the new timestamp is not consecutive wrt. the previous timestamp */
		if (consec_invalid_ts_deltas) {
			LOG_ERR("sdu_ref_us not from consecutive frames (delta: %d us)",
				sdu_ref_delta_us);
		} else {
			LOG_DBG("sdu_ref_us not from consecutive frames (delta: %d us)",
				sdu_ref_delta_us);
		}

		sdu_ref_not_consecutive = true;
		ctrl_blk.prev_pres_sdu_ref_us = meta_in->ref_ts_us;
		consec_invalid_ts_deltas++;

	} else if (!IN_RANGE(sdu_ref_delta_us,
			     CONFIG_AUDIO_FRAME_DURATION_US - SDU_REF_CH_DELTA_MAX_US,
			     CONFIG_AUDIO_FRAME_DURATION_US + SDU_REF_CH_DELTA_MAX_US)) {
		/* If timestamp is consecutive but has invalid delta: Estimate the timestamp
		 */
		if (consec_invalid_ts_deltas) {
			LOG_ERR("Invalid sdu_ref_us delta (%d) meta_in->ref_ts_us %d us. "
				"Estimating.",
				sdu_ref_delta_us, meta_in->ref_ts_us);
		} else {
			LOG_DBG("Invalid sdu_ref_us delta (%d) meta_in->ref_ts_us %d us. "
				"Estimating.",
				sdu_ref_delta_us, meta_in->ref_ts_us);
		}

		/* Estimate ref_ts_us.
		 * If the SDU ref was estimated, we don't update the previous reference with
		 * the estimated value. This is to avoid an infinite loop of estimations.
		 */
		uint32_t ref_ts_temp_us = meta_in->ref_ts_us;

		meta_in->ref_ts_us = ctrl_blk.prev_pres_sdu_ref_us + CONFIG_AUDIO_FRAME_DURATION_US;
		ctrl_blk.prev_pres_sdu_ref_us = ref_ts_temp_us;

		consec_invalid_ts_deltas++;
	} else {
		/* The new timestamp is valid. It is consecutive and
		 * within the expected range compared to the last timestamp.
		 */
		ctrl_blk.prev_pres_sdu_ref_us = meta_in->ref_ts_us;
		consec_invalid_ts_deltas = 0;
	}

	/*** Presentation compensation ***/
	if (ctrl_blk.pres_comp.enabled) {
		audio_datapath_presentation_compensation(meta_in->data_rx_ts_us, meta_in->ref_ts_us,
							 sdu_ref_not_consecutive);
	}

	/*** Decode ***/

	int ret;
	struct net_buf *audio_frame_out = net_buf_alloc(&audio_pcm_pool, K_NO_WAIT);

	if (audio_frame_out == NULL) {
		LOG_ERR("Out of I2S PCM TX buffers.");
		return;
	}

	/* Output I2S related metadata */
	struct audio_metadata *meta_out = net_buf_user_data(audio_frame_out);
	*meta_out = i2s_meta;
	meta_out->data_len_us = meta_in->data_len_us;
	meta_out->ref_ts_us = meta_in->ref_ts_us;
	meta_out->data_rx_ts_us = meta_in->data_rx_ts_us;
	meta_out->bad_data = meta_in->bad_data;

	ret = sw_codec_decode(audio_frame_in, audio_frame_out);
	if (ret) {
		net_buf_unref(audio_frame_out);
		LOG_WRN("SW codec decode error: %d", ret);
		return;
	}

	if (IS_ENABLED(CONFIG_SD_CARD_PLAYBACK)) {
		if (sd_card_playback_is_active()) {
			sd_card_playback_mix_with_stream((void *const)audio_frame_out->data,
							 audio_frame_out->len);
		}
	}

	if (audio_frame_out->len != PCM_NUM_BYTES_MONO * CONFIG_AUDIO_OUTPUT_CHANNELS) {
		LOG_WRN("Decoded audio has wrong size: %d. Expected: %d", audio_frame_out->len,
			PCM_NUM_BYTES_MONO * CONFIG_AUDIO_OUTPUT_CHANNELS);
		/* Discard frame */
		net_buf_unref(audio_frame_out);
		return;
	}

	/*** Add audio data to FIFO buffer ***/
	uint32_t num_blks_in_fifo = filled_blocks_get();

	if ((num_blks_in_fifo + NUM_BLKS_IN_FRAME) > FIFO_NUM_BLKS) {
		LOG_WRN("Output audio stream overrun - Discarding audio frame");

		/* Discard frame to allow consumer to catch up */
		net_buf_unref(audio_frame_out);
		return;
	}

	uint32_t out_blk_idx = ctrl_blk.out.prod_blk_idx;

	for (uint32_t i = 0; i < NUM_BLKS_IN_FRAME; i++) {
		if (IS_ENABLED(CONFIG_AUDIO_BIT_DEPTH_16)) {
			memcpy(&ctrl_blk.out.fifo[out_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS],
			       (int16_t *)audio_frame_out->data, BLK_MULTI_CHAN_SIZE_OCTETS);
		} else if (IS_ENABLED(CONFIG_AUDIO_BIT_DEPTH_32)) {
			memcpy(&ctrl_blk.out.fifo[out_blk_idx * BLK_MULTI_CHAN_NUM_SAMPS],
			       (int32_t *)audio_frame_out->data, BLK_MULTI_CHAN_SIZE_OCTETS);
		}

		/* Remove consumed data from net buffer */
		net_buf_pull(audio_frame_out, BLK_MULTI_CHAN_SIZE_OCTETS);

		/* Record producer block start reference */
		ctrl_blk.out.prod_blk_ts[out_blk_idx] =
			meta_in->data_rx_ts_us + (i * BLK_PERIOD_US);

		out_blk_idx = NEXT_IDX(out_blk_idx);
	}

	ctrl_blk.out.prod_blk_idx = out_blk_idx;

	net_buf_unref(audio_frame_out);
}

int audio_datapath_start(struct k_msgq *audio_q_rx)
{
	__ASSERT_NO_MSG(audio_q_rx != NULL);

	if (!ctrl_blk.datapath_initialized) {
		LOG_WRN("Audio datapath not initialized");
		return -ECANCELED;
	}

	if (!ctrl_blk.stream_started) {
		ctrl_blk.in.audio_q = audio_q_rx;

		/* Clear counters and mute initial audio */
		memset(&ctrl_blk.out, 0, sizeof(ctrl_blk.out));

		audio_datapath_i2s_start();
		ctrl_blk.stream_started = true;

